Repository: yudizlto/ourtube_flutter
Catalog: lib/l10n/app_*.arb
Languages: id

source: Settings
id: Setelan

source: App version
id: Versi aplikasi

# app_description
source: OurTube, a YouTube clone app
id: OurTube, sebuah aplikasi kloning YouTube

source: Help and policy
id: Bantuan dan kebijakan

# help_and_feedback
source: Help & feedback
id: Bantuan & saran

source: Account
id: Akun

source: General
id: Umum

source: Switch account
id: Ganti akun

source: Notifications
id: Notifikasi

source: Privacy
id: Privasi

source: Help
id: Bantuan

source: About
id: Tentang

source: Appearance
id: Tampilan

# appearance_description
source: Choose your light or dark theme preference
id: Pilih tema terang atau gelap sesuai keinginan Anda

source: Light theme
id: Tema terang

source: Dark theme
id: Tema gelap

source: Cancel
id: Batal

source: Change
id: Ubah

source: App language
id: Bahasa aplikasi

# app_language_description
source: English
id: Indonesia

# language_english
source: English
id: Inggris

# language_indonesian
source: Indonesian
id: Indonesia

# language_japanese
source: Japanese
id: Jepang

source: Change app language?
id: Ubah bahasa?

# change_app_language_description
source: This will change the language used in the app including buttons, text and dialogs
id: Tindakan ini akan mengubah bahasa yang digunakan dalam aplikasi, termasuk tombol, teks, dan dialog

source: View channel
id: Lihat channel

source: Share channel
id: Bagikan channel

source: Turn on Incognito
id: Aktifkan Mode Samaran

source: Google account
id: Akun Google

source: History
id: Histori

source: View all
id: Lihat semua

source: Private
id: Pribadi

source: Liked videos
id: Video yang disukai

source: Remove from watch history
id: Hapus dari histori tontonan

source: Share video
id: Bagikan video

source: Save to playlist
id: Simpan ke playlist

source: Home
id: Beranda

source: You
id: Anda

source: Subscriptions
id: Subscription

source: Delete
id: Hapus

source: No videos
id: Tidak ada video

source: Add videos
id: Tambahkan video

# no_videos_in_playlist
source: No videos in this playlist yet
id: Belum ada video dalam playlist ini

source: by
id: oleh

source: views
id: ditonton

source: week ago
id: minggu yang lalu

source: weeks ago
id: minggu yang lalu

source: month ago
id: bulan yang lalu

source: months ago
id: bulan yang lalu

source: year ago
id: tahun yang lalu

source: years ago
id: tahun yang lalu

source: hour ago
id: jam yang lalu

source: hours ago
id: jam yang lalu

source: minute ago
id: menit yang lalu

source: minutes ago
id: menit yang lalu

source: second ago
id: detik yang lalu

source: seconds ago
id: detik yang lalu

source: day ago
id: hari yang lalu

source: days ago
id: hari yang lalu

source: hour
id: jam

source: hours
id: jam

source: minute
id: menit

source: minutes
id: menit

source: seconds
id: detik

source: days
id: hari

source: Remove from
id: Hapus dari

source: Visibility
id: Visibilitas

source: Set visibility
id: Setel visibilitas

source: Create
id: Buat

source: Title
id: Judul

source: Public
id: Publik

# public_description
source: Anyone can search for and view
id: Dapat ditemukan dan dilihat siapa pun

source: Unlisted
id: Tidak publik

# unlisted_description
source: Anyone with the link can view
id: Hanya dapat dilihat orang yang tahu linknya

# private_description
source: Only people you choose can view
id: Hanya dapat dilihat oleh Anda

source: New playlist
id: Playlist baru

source: Manage videos
id: Kelola video

source: ...more
id: ...selengkapnya

# more_about_channel
source: More about this channel
id: Selengkapnya tentang channel ini

source: videos
id: video

# videos_label
source: Videos
id: Video

source: Subscribers
id: subscriber

source: Playlists
id: Playlist

source: Community
id: Komunitas

source: More info
id: Info selengkapnya

source: Joined
id: Bergabung pada

source: Description
id: Deskripsi

# empty_my_home
source: Create content on any device
id: Buat konten di perangkat apa pun

# empty_my_home_description
source: Upload and record at home or on the go. Everything you make public will appear here.
id: Upload dan rekam konten di rumah atau kapan saja di mana saja. Semua video publik Anda akan muncul di sini.

# empty_videos
source: Explore and upload videos
id: Jelajahi dan unggah video

# empty_videos_description
source: Browse and upload your favorite videos. Engage with the content you love and share your own videos with the world.
id: Telusuri dan unggah video favorit Anda. Nikmati konten yang Anda sukai dan bagikan video Anda sendiri ke seluruh dunia.

# empty_shorts
source: Create and share Shorts
id: Buat dan bagikan Shorts

# empty_shorts_description
source: Capture moments in short-form videos. Share your creativity and engage with a larger audience through fun, quick videos.
id: Tangkap momen dalam video pendek. Bagikan kreativitas Anda dan jangkau audiens lebih luas melalui video-video seru.

# empty_playlist
source: Manage your playlist
id: Kelola playlist Anda

# empty_playlist_description
source: Organize your videos into playlists and share them with others. Curate collections that showcase your favorite videos and themes.
id: Atur video Anda ke dalam playlist dan bagikan dengan orang lain. Buat koleksi yang menampilkan video dan tema favorit Anda.

# empty_community
source: Manage your playlist
id: Kelola komunitas Anda

# empty_community_description
source: Posts appear here after you publish and will be visible to your community
id: Post akan muncul di sini setelah Anda publikasikan dan akan terlihat oleh komunitas Anda

# empty_subscriptions
source: New videos right to you
id: Video baru langsung ke Anda

# empty_subscriptions_description
source: Subscribe to get the latest videos from channels you love.
id: Subscribe untuk mendapatkan video terbaru dari channel yang Anda sukai.

source: Latest
id: Terbaru

source: Sort by
id: Urutkan menurut

source: Oldest
id: Terlama

source: Your videos
id: Video Anda

source: Save to device
id: Simpan ke perangkat

source: Save
id: Simpan

source: Select audience
id: Pilih audiens

source: This video is set to
id: Video ini ditetapkan sebagai

source: Yes, it's made for kids
id: Ya, video ini dibuat untuk anak-anak

source: No, it's not made for kids
id: Tidak, video ini tidak dibuat untuk anak-anak

# age_restriction
source: Age restriction (advanced)
id: Pembatasan usia (lanjutan)

# age_restriction_question
source: Do you want to restrict your video to an adult audience?
id: Apakah Anda ingin membatasi video agar hanya dapat diakses oleh audiens dewasa?

# yes_restrict_to_adults
source: Yes, restrict my video to viewers over 18
id: Ya, batasi video saya untuk penonton berusia 18 tahun ke atas

# no_restrict_to_adults
source: No, don't restrict my video to viewers over 18
id: Tidak, jangan batasi video saya untuk penonton berusia 18 tahun ke atas

# add_to_playlist
source: Add to playlists
id: Tambahkan ke playlist

source: Comments
id: Komentar

source: On
id: Aktif

source: Off
id: Nonaktif

source: Publish now
id: Publikasikan sekarang

source: Discard
id: Buang

source: Discard changes?
id: Hapus perubahan?

# discard_changes_description
source: Changes on this page will not be saved
id: Perubahan pada halaman ini tidak akan disimpan

source: Updated today
id: Diperbarui hari ini

source: No subscribers
id: Tidak ada subscriber

source: Create a title
id: Buat judul

# title_is_required
source: A title is required
id: Judul wajib diisi

# choose_shorter_title
source: Choose a shorter title
id: Pilih judul yang lebih singkat

# choose_shorter_description
source: Choose a shorter description
id: Pilih deskripsi yang lebih singkat

source: Add description
id: Tambahkan deskripsi

source: Edit description
id: Tambahkan deskripsi

# use_shorter_description
source: Use a shorter description
id: Gunakan deskripsi yang lebih singkat

source: Text is too long
id: Teks terlalu panjang

source: Video updated
id: Video diperbarui

source: Playlist deleted
id: Playlist dihapus

source: Playlist created
id: Playlist dibuat

source: Name
id: Nama

source: Channel URL
id: URL channel

source: Channel settings
id: Setelan channel

source: Copied
id: Disalin

# choose_shorter_name
source: Choose a shorter name
id: Pilih nama yang lebih pendek

source: Add a description
id: Tambahkan deskripsi

source: Description changed
id: Deskripsi diubah

# keep_my_subscriptions_private
source: Keep all my subscriptions private
id: Jangan tampilkan subscription saya

# channel_changes_dialog
source: Changes made to your name and profile picture are visible only on OurTube and not other Google services.
id: Perubahan nama dan foto profil Anda hanya dapat dilihat di OurTube, tidak di layanan Google lainnya.

# name_changes_visible_warning
source: Visible to anyone on OurTube
id: Dapat dilihat oleh siapa saja di OurTube

# name_changes_warning
source: Changes to your name will be reflected only on OurTube. You can change your name twice in 14 days.
id: Perubahan nama hanya akan terlihat di OurTube. Anda dapat mengubah nama dua kali dalam 14 hari.

source: Name changed
id: Nama diubah

# enter_name_validation
source: Enter a name
id: Masukkan nama

# handle_changes_visible_warning
source: Visible to all users on OurTube.
id: Terlihat oleh semua pengguna di OurTube.

# handle_changes_warning
source: You can change your handle back within 14 days. This becomes your channel URL. Handles can be changed twice every 14 days.
id: Anda dapat mengubah kembali nama sebutan channel Anda dalam 14 hari. Nama ini akan menjadi URL channel Anda. Nama sebutan channel dapat diubah dua kali setiap 14 hari.

# add_handle_validation
source: Add a handle to continue
id: Tambahkan nama sebutan channel untuk melanjutkan

# choose_longer_handle
source: Choose a longer handle
id: Pilih nama sebutan channel yang lebih panjang

# handle_unsupported_characters
source: Handle contains unsupported characters
id: Nama sebutan channel berisi karakter yang tidak didukung

# handel_cannot_end_with_dot
source: Handle cannot end with this character
id: Nama sebutan channel tidak boleh diakhiri dengan karakter ini

# handle_changed
source: Handle and Channel URL changed
id: Nama Sebutan dan URL Channel diubah

# take_photo
source: Take a photo
id: Ambil foto

source: Choose from your photos
id: Pilih dari foto Anda

# banner_updated
source: Channel banner updated successfully.
id: Spanduk channel berhasil diperbarui.

source: Share
id: Bagikan

source: Removed from
id: Dihapus dari

# you_dont_have_any_playlists
source: You dont't have any playlists.
id: Anda tidak memiliki playlist.

source: Save video to ...
id: Tambahkan video ke ...

source: Done
id: Selesai

source: Video added to playlist
id: Video ditambahkan ke playlist

source: No comments yet
id: Belum ada komentar

# no_comments_yet_description
source: Say something to start the conversation
id: Katakan sesuatu untuk memulai percakapan

source: Subscribed
id: Disubscribe

# subscription_added_message
source: Subscription added
id: Subscription ditambahkan

# unsubscribed_message
source: Unsubscribed from {channelName}
id: Telah unsubscribe dari {channelName}

# comments_not_supported_on_private
source: Comments are not supported on private videos.
id: Fitur komentar tidak didukung pada video pribadi.

source: Add a comment...
id: Tambahkan komentar...

source: Report
id: Laporkan

# likes_label
source: Likes
id: Suka

# views_label
source: Views
id: Penayangan

# comment_placeholder
source: Share your thoughts...
id: Tambahkan komentar...

source: Comment added
id: Komentar ditambahkan

# search_bar_placeholder
source: Search OurTube
id: Telusuri OurTube

source: Remove from search history?
id: Hapus dari histori penelusuran?

source: Remove
id: Hapus

source: Sign in
id: Login

source: Sign
id: Login

# unauthenticatedHomeTitle
source: Try searching to get started
id: Coba telusuri untuk memulai

# unauthenticatedHomeContent
source: Start watching videos to help us build a feed of videos you'll love.
id: Mulailah menonton video untuk membantu kami membuat feed berisi video yang Anda sukai.

# unauthenticatedSubscriptionTitle
source: Don't miss new videos
id: Jangan lewatkan video baru

# unauthenticatedSubscriptionContent
source: Sign in to see updates from your favorite OurTube channels
id: Login untuk melihat update dari channel OurTube favorite Anda

# unauthenticatedLibraryTitle
source: Enjoy your favorite videos
id: Nikmati video favorit Anda

# unauthenticatedLibraryContent
source: Sign in to access videos that you've liked or saved
id: Login untuk mengakses video yang disukai atau yang telah disimpan

# unauthenticatedSettingTitle
source: Do more with OurTube
id: Lakukan lebih banyak dengan OurTube

# unauthenticatedSettingContent
source: Sign in now to upload, save, and comment on videos
id: Masuk sekarang untuk mengunggah, menyimpan, dan berkomentar di video

# all_category
source: All
id: Semua

# music_category
source: Music
id: Musik

# movies_category
source: Movies
id: Film

# sports_category
source: Sports
id: Olahraga

# gaming_category
source: Gaming
id: Game

# category_no_content_message
source: No content available in this category yet. Check back later!
id: Belum ada konten dalam kategori ini. Silakan cek kembali nanti!

source: Your notifications live here
id: Notifikasi Anda ada di sini

# subscribe_to_favorite_channels
source: Subscribe to your favorite channels to get notified about their latest videos.
id: Subscribe ke channel favorit untuk mendapatkan notifikasi video terbaru dari channel tersebut.

source: Create a post
id: Buat postingan

# hide_notification
source: Hide this notification
id: Sembunyikan notifikasi ini

# turn_off_notification
source: Turn off all from {source}
id: Nonaktifkan semua dari {source}

source: Send feedback
id: Kirim masukan

# video_uploaded_to_your_videos
source: Uploaded to Your Videos
id: Diupload ke Video Anda

# video_upload_deleted
source: Video deleted from your uploads
id: Video dihapus dari upload Anda

source: Upload deleted
id: Upload dihapus

source: See video
id: Lihat video

source: All views of this video removed from history
id: Semua penayangan video ini dihapus dari histori

# video_size_error
source: The video size must not exceed {maxSize}MB.
id: Ukuran video tidak boleh lebih dari {maxSize}MB.

source: Upload Short
id: Upload video Short

# caption_for_short_hint_text
source: Caption your Short
id: Tambahkan teks pada video Shorts

# undo_button
source: Undo
id: Urungkan

# all_button
source: All
id: Semua

# posts_label
source: Posts
id: Postingan

source: All subscriptions
id: Semua subscription

# most_relevant_order
source: Most relevant
id: Paling relevan

source: Sign out
id: Keluar

source: Log in to OurTube
id: Masuk ke OurTube

source: Continue with Google
id: Lanjutkan dengan Google

source: Don't have an account?
id: Belum punya akun?

source: Sign up
id: Daftar

source: Already have an account?
id: Sudah punya akun?

source: Log in
id: Masuk

source: Sign up for OurTube
id: Daftar ke OurTube

# share_your_videos_with_anyone
source: Share your videos with anyone, with anyone, or everyone.
id: Bagikan video Anda kepada siapa pun, atau semua orang.

# no_content_on_this_channel
source: This channel doesn't have any content
id: Channel ini tidak memiliki konten apa pun

# dislike_label
source: Dislike
id: Tidak suka

# summary_label
source: Description
id: Deskripsi

# about_channel
source: About
id: Tentang

# channelSubscribers
source: {count} subscribers
id: {count} subscriber
